node {
  name: "input_data"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Targets"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Drop_out_keep_prob"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "model/LSTM_setup/pack/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 15
      }
    }
  }
}
node {
  name: "model/LSTM_setup/pack/values_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 52
      }
    }
  }
}
node {
  name: "model/LSTM_setup/pack"
  op: "Pack"
  input: "model/LSTM_setup/pack/values_0"
  input: "model/LSTM_setup/pack/values_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/LSTM_setup/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/LSTM_setup/zeros"
  op: "Fill"
  input: "model/LSTM_setup/pack"
  input: "model/LSTM_setup/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM_setup/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "model/LSTM_setup/ExpandDims"
  op: "ExpandDims"
  input: "input_data"
  input: "model/LSTM_setup/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Slice/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\377\377\377\377\001\000\000\000\377\377\377\377"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Slice"
  op: "Slice"
  input: "model/LSTM_setup/ExpandDims"
  input: "model/LSTM/LSTM_state/Slice/begin"
  input: "model/LSTM/LSTM_state/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Squeeze"
  op: "Squeeze"
  input: "model/LSTM/LSTM_state/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/Slice/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\032\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/Slice"
  op: "Slice"
  input: "model/LSTM_setup/zeros"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/Slice/begin"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split"
  op: "Split"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split/split_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 14
        }
        dim {
          size: 52
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\016\000\000\0004\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0799999982119
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0799999982119
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  op: "Sub"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  op: "Mul"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  op: "Add"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Assign"
  op: "Assign"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/read"
  op: "Identity"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/concat"
  op: "Concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/concat/concat_dim"
  input: "model/LSTM/LSTM_state/Squeeze"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/MatMul"
  op: "MatMul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/concat"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 52
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 52
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias/Assign"
  op: "Assign"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias/read"
  op: "Identity"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/MatMul"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1"
  op: "Split"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1/split_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_1"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1:2"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Sigmoid"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Sigmoid_1"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Tanh"
  op: "Tanh"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul_1"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Sigmoid_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_2"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Tanh_1"
  op: "Tanh"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Sigmoid_2"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/split_1:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul_2"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Tanh_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/concat"
  op: "Concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/concat/concat_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/add_2"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/Shape"
  op: "Shape"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/sub"
  op: "Sub"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/max"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/RandomUniform"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/add"
  op: "Add"
  input: "Drop_out_keep_prob"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/Floor"
  op: "Floor"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/Inv"
  op: "Inv"
  input: "Drop_out_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/mul_2"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/Inv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/mul_1"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/Slice/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\032\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\032\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/Slice"
  op: "Slice"
  input: "model/LSTM_setup/zeros"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/Slice/begin"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split"
  op: "Split"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split/split_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 52
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\0004\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0799999982119
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0799999982119
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  op: "Sub"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/max"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  op: "Mul"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  op: "Add"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/mul"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Assign"
  op: "Assign"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/read"
  op: "Identity"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/concat"
  op: "Concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/concat/concat_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/dropout/mul_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/MatMul"
  op: "MatMul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/concat"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 52
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 52
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias/Assign"
  op: "Assign"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias/read"
  op: "Identity"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/MatMul"
  input: "model/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1"
  op: "Split"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1/split_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_1"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1:2"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Sigmoid"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Sigmoid_1"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Tanh"
  op: "Tanh"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul_1"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Sigmoid_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_2"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Tanh_1"
  op: "Tanh"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Sigmoid_2"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/split_1:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul_2"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Tanh_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/concat"
  op: "Concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/concat/concat_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/add_2"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/Shape"
  op: "Shape"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/sub"
  op: "Sub"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/max"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/RandomUniform"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/add"
  op: "Add"
  input: "Drop_out_keep_prob"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/Floor"
  op: "Floor"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/Inv"
  op: "Inv"
  input: "Drop_out_keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/mul_2"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/Inv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/mul_1"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/concat"
  op: "Concat"
  input: "model/LSTM/LSTM_state/concat/concat_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell/Cell1/BasicLSTMCell/concat"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Slice_1/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Slice_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\377\377\377\377\001\000\000\000\377\377\377\377"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Slice_1"
  op: "Slice"
  input: "model/LSTM_setup/ExpandDims"
  input: "model/LSTM/LSTM_state/Slice_1/begin"
  input: "model/LSTM/LSTM_state/Slice_1/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/Squeeze_1"
  op: "Squeeze"
  input: "model/LSTM/LSTM_state/Slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/Slice/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\032\000\000\000"
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/Slice"
  op: "Slice"
  input: "model/LSTM/LSTM_state/concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/Slice/begin"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split"
  op: "Split"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split/split_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Linear/concat/concat_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Linear/concat"
  op: "Concat"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Linear/concat/concat_dim"
  input: "model/LSTM/LSTM_state/Squeeze_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Linear/MatMul"
  op: "MatMul"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Linear/concat"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Linear/MatMul"
  input: "model/LSTM_state/MultiRNNCell/Cell0/BasicLSTMCell/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split_1/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split_1"
  op: "Split"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split_1/split_dim"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add_1"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split_1:2"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Sigmoid"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/mul"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Sigmoid_1"
  op: "Sigmoid"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Tanh"
  op: "Tanh"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/split_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/mul_1"
  op: "Mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Sigmoid_1"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add_2"
  op: "Add"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/mul"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Tanh_1"
  op: "Tanh"
  input: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/LSTM/LSTM_state/MultiRNNCell_1/Cell0/BasicLSTMCell/Sigmoid_2"
  op: "Sigmoid"
